DataProcessors/CRM_АРМ_Конфигуратор.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>CRM_АРМ_Конфигуратор</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Documents/Renault_ИзменениеСкидокНаАвтомобили.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Renault_ИзменениеСкидокНаАвтомобили</Name>
			<Comment>Изменение скидок на автомобили (Renault)</Comment>
			<BasedOn>
				<xr:Item>Document.ПоступлениеАвтомобилей</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Renault_СкидкиНаАвтомобили</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор документа - пользователь, создавший документ.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий к документу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Comment>Валюта документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Comment>Курс валюты документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСкидки</Name>
					<Comment>Устанавливаемый тип цен</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыСкидок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонца</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейНаСкладе</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодВыпуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ, на основании которого введен данный</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Юридическое лицо, от которого выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Выполняемая документом операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании в котором был выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Автомобили</Name>
					<Comment>Автомобили цены которых надо изменить</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Автомобиль</Name>
							<Comment>Автомобиль</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Модели</v8:Type>
								<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантКомплектации</Name>
							<Comment>Вариант комплектации модели</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСкидки</Name>
							<Comment>Новая цена автомобиля или модели</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусАвтомобиля</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CRM_СтатусыАвтомобилей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаличиеПТС</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтсутствиеКлиента</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/DMS_КоммерческиеАкции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>DMS_КоммерческиеАкции</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомбинируемаПолностью</Name>
					<Comment>(акция комбинируема с любыми другими акциями)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодАкции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецАкции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DMS_ВладельцыСервисов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автовыбор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипАкции</Name>
					<Comment>0-все, 1-Кредит, 2-TradeIn, 3-Утилизация</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Условия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Модели</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеСкидкиУчастиеДилера</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантСкидки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.DMS_ВариантыСкидки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоДействия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкончаниеДействия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГодыВыпуска</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Год</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДилерскиеЦентры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДилерскийЦентр</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Покупатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИНН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/CRM_АРМ_Конфигуратор/Forms/ФормаУстановкиСкидок/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СкидкаОбщаяСуммаПриИзменении(Неопределено);
	//@++ Васильев ВА
	ПолучитьСписокСкидокИзВременногоХранилища(КлючТаблицыСпискаСкидок);
	ОбновитьСуммы();
	УстановитьТекстСкидки();
	//@++
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСуммы()
	СуммаАкций = 0;СуммаСкидки = 0;
	Для каждого Стр Из СписокСкидок Цикл
		////Если Стр.ТипСкидки <> СкидкаRenault Тогда
		Если Стр.Документ <> Документы.Renault_ИзменениеСкидокНаАвтомобили.ПустаяСсылка() Тогда
			СуммаСкидки = СуммаСкидки + Стр.СуммаСкидки;
		Иначе	
			СуммаАкций = СуммаАкций + Стр.СуммаСкидки;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	Ответ = Новый Структура;
	Ответ.Вставить("СуммаСкидки", СуммаСкидки+СуммаАкций);
	Ответ.Вставить("СуммаДоставки", СуммаДоставки);
	Ответ.Вставить("СуммаКонечная", СуммаКонечная);	
	//@++Васильев ВА
	Ответ.Вставить("КлючТаблицыСпискаСкидок", КлючТаблицыСпискаСкидок);
	//@++
	Закрыть(Ответ);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
    Закрыть(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура СкидкаОбщаяПроцентПриИзменении(Элемент)
	СуммаСкидки = Окр(СуммаКонфигурации * СкидкаОбщаяПроцент / 100);
	СуммаКонечная = ПолучитьОбщуюСумму();
КонецПроцедуры

&НаКлиенте
Процедура СкидкаОбщаяСуммаПриИзменении(Элемент)
	//Козлов Е.А. Начало 24.01.2017
	СкидкаОбщаяПроцент = ?(ЗначениеЗаполнено(СуммаКонфигурации), 100 * СуммаСкидки / СуммаКонфигурации, 0);
	//СкидкаОбщаяПроцент = СуммаСкидки / СуммаКонфигурации * 100;
	//Козлов Е.А. Конец
	СуммаКонечная = ПолучитьОбщуюСумму();
КонецПроцедуры

&НаКлиенте
Процедура СуммаДоставкиПриИзменении(Элемент)
	СуммаКонечная = ПолучитьОбщуюСумму();
КонецПроцедуры

&НаКлиенте
Процедура СуммаКонечнаяПриИзменении(Элемент)
	
	СуммаВычисленная = СуммаКонечная - СуммаКонфигурации + СуммаСкидки;
	Если СуммаВычисленная >= 0 Тогда
		СуммаДоставки = СуммаВычисленная;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьОбщуюСумму()
	
	Возврат СуммаКонфигурации + СуммаДоставки - СуммаСкидки-СуммаАкций;
	
КонецФункции

//@++ Васильев ВА
&НаКлиенте
Процедура СуммаСкидкиНажатие(Элемент)
	
	// НАЧАЛО DMSCOR-1030
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Строки",              ПолучитьМассивСтрокСкидок());	
	ПараметрыФормы.Вставить("ТипСкидки_Renault",   СкидкаRenault);	
	ПараметрыФормы.Вставить("СуммаКонфигурации",   СуммаКонфигурации);
	ПараметрыФормы.Вставить("Автомобиль",          Автомобиль);	
	ПараметрыФормы.Вставить("ВариантКомплектации", Версия);	
	ПараметрыФормы.Вставить("ДилерскийЦентр",      ДилерскийЦентр);	
	ПараметрыФормы.Вставить("ДатаДоговора",        Дата);	
	ПараметрыФормы.Вставить("ЭтоКорпоративныйКлиент", ЭтоКорпоративныйКлиент);	
	
	ОткрытьФорму("Документ.Renault_Договор.Форма.ИзменениеСкидок", ПараметрыФормы, ЭтаФорма);
	// КОНЕЦ  
	
	//ОткрытьФорму("Документ.Renault_Договор.Форма.ИзменениеСкидок",Новый Структура("Строки, ТипСкидки_Renault, СуммаКонфигурации",ПолучитьМассивСтрокСкидок(), СкидкаRenault, СуммаКонфигурации),ЭтаФорма);
	
КонецПроцедуры

&НаСервере 
Процедура ПоместитьСписокСкидокВоВременноеХранилище(КлючТаблицыСпискаСкидок) 
	ОбъектСписокСкидок = РеквизитФормыВЗначение("СписокСкидок");
 	ПоместитьВоВременноеХранилище(ОбъектСписокСкидок, КлючТаблицыСпискаСкидок); 	
КонецПроцедуры 

&НаСервере
Процедура ПолучитьСписокСкидокИзВременногоХранилища(КлючТаблицыСпискаСкидок)
	Если КлючТаблицыСпискаСкидок <> Неопределено Тогда
		Попытка
			ТЗСписокСкидок = ПолучитьИзВременногоХранилища(КлючТаблицыСпискаСкидок);
		Исключение
			Сообщить("Не удалось получить ТЗ по ИД: " + КлючТаблицыСпискаСкидок);
		КонецПопытки;
		Если ТЗСписокСкидок <> неопределено Тогда
			СписокСкидок.Загрузить(ТЗСписокСкидок); 
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивСтрокСкидок()
	
	ОбъектСписокСкидок = РеквизитФормыВЗначение("СписокСкидок");
	МассивСтрок = Новый Массив;
	Для Каждого Стр Из ОбъектСписокСкидок Цикл
		////Если Стр.ТипСкидки <> СкидкаRenault Тогда
		Если Стр.Документ <> Документы.Renault_ИзменениеСкидокНаАвтомобили.ПустаяСсылка() Тогда
			МассивСтрок.Добавить(Новый Структура("ТипСкидки,ПроцентСкидки,СуммаСкидки,Документ,ДатаНачала,ДатаКонца",
						Стр.ТипСкидки,Стр.ПроцентСкидки,Стр.СуммаСкидки,Стр.Документ,Стр.ДатаНачала,Стр.ДатаКонца));
		КонецЕсли;
	КонецЦикла;	
		
	Возврат МассивСтрок;
	
КонецФункции

&НаКлиенте
Процедура УстановитьТекстСкидки() 
	Элементы.СуммаСкидки.Заголовок=?(СуммаСкидки=0,"Установить скидку",СуммаСкидки);
	Элементы.СуммаКоммАкций.Заголовок=?(СуммаАкций=0,"Редактировать акции",СуммаАкций);
КонецПроцедуры	

&НаКлиенте
Процедура СуммаКоммАкцийНажатие(Элемент)
	
	//мСписок = СуммаКоммАкцийНажатиеНаСервере();
	//
	//ПФ = Новый Структура("Список", мСписок);
	
	мАкции = СуммаКоммАкцийНажатиеНаСервере();
	МассивЗначений = Новый Массив;
	Для Каждого Стр Из мАкции Цикл		
		МассивЗначений.Добавить(Новый Структура("Акция, СуммаСкидки", Стр.Акция, Стр.СуммаСкидки));	
	КонецЦикла;	
	
	ПФ = Новый Структура;
	ПФ.Вставить("МассивЗначений", МассивЗначений);	
	ПФ.Вставить("СуммаАвтомобиляИБазовыхОпций", СуммаКонфигурации);
	ПФ.Вставить("Кредит", Кредит);
	ПФ.Вставить("TradeIn", TradeIn);
	ПФ.Вставить("Утилизация", Утилизация);
	ПФ.Вставить("VIN", Автомобиль.VIN);
	ПФ.Вставить("Модель", Модель);
	ПФ.Вставить("ВариантКомплектации", Версия);
	ПФ.Вставить("ДилерскийЦентр", ДилерскийЦентр);
	ПФ.Вставить("ГодВыпуска", Renault_ОбщегоНазначения.ПолучитьГодВыпуска(Автомобиль));
	ПФ.Вставить("СтоимостьБазы", СуммаКонфигурации);
	Ответ = ОткрытьФормуМодально("Документ.Renault_Договор.Форма.СкидкиRenault", ПФ, ЭтаФорма);
	НоваяСуммаАкций = 0;
	Если Ответ <> Неопределено Тогда
		
		//++ DMSREN-57
		//мСкидки = СписокСкидок.НайтиСтроки(Новый Структура("ТипСкидки", СкидкаRenault));
		//Для Каждого СтрУдаления из мСкидки Цикл
		//	СписокСкидок.Удалить(СтрУдаления);
		//КонецЦикла;
		
		мСкидки = СписокСкидок.НайтиСтроки(Новый Структура("Документ", Документы.Renault_ИзменениеСкидокНаАвтомобили.ПустаяСсылка()));
		Для Каждого СтрУдаления из мСкидки Цикл
			СписокСкидок.Удалить(СтрУдаления);
		КонецЦикла;
		//-- DMSREN-57
		
		Для Каждого Стр Из Ответ Цикл
			НовСкидка = СписокСкидок.Добавить();
			НовСкидка.ТипСкидки = СкидкаRenault;
			НовСкидка.СуммаСкидки = Стр.ЗначениеСкидки;
			ЗаполнитьЗначенияСвойств(НовСкидка, Стр);
			НоваяСуммаАкций = НоваяСуммаАкций + Стр.ЗначениеСкидки;
		КонецЦикла;	

	КонецЕсли;
	
	СуммаАкций = НоваяСуммаАкций;
	СкидкаОбщаяПроцент = ?(ЗначениеЗаполнено(СуммаКонфигурации), 100 * (СуммаСкидки+СуммаАкций) / СуммаКонфигурации, 0);
	//СкидкаОбщаяПроцент = СуммаСкидки / СуммаКонфигурации * 100;
	//Козлов Е.А. Конец 
	СуммаКонечная = ПолучитьОбщуюСумму();
	ПоместитьСписокСкидокВоВременноеХранилище(КлючТаблицыСпискаСкидок);
	ОбновитьСуммы();
	УстановитьТекстСкидки();	
	
КонецПроцедуры

&НаСервере
Функция СуммаКоммАкцийНажатиеНаСервере();
	
	СписокАкций = СписокСкидок.Выгрузить(,"Акция, СуммаСкидки");
	СписокАкций.Очистить();
	
	Для каждого Стр Из СписокСкидок Цикл
		Если Стр.Акция <> Справочники.DMS_КоммерческиеАкции.ПустаяСсылка() Тогда
			ЗаполнитьЗначенияСвойств(СписокАкций.Добавить(), Стр)
		КонецЕсли;
	КонецЦикла;
	
	Возврат СписокАкций
	
	////Возврат СписокСкидок.Выгрузить();
		
	//Запрос = Новый Запрос;
	//Если СпособОплаты = Перечисления.Renault_СпособыОплаты.Кредит Тогда
	//	НеКредит = Ложь;
	//Иначе 
	//	НеКредит = Истина;
	//КонецЕсли;
	//
	//Запрос.УстановитьПараметр("Дата", НачалоДня(ТекущаяДатаСеанса()));
	//Запрос.УстановитьПараметр("Модель", Модель);
	//Запрос.УстановитьПараметр("Версия", Версия);
	//Запрос.УстановитьПараметр("Вид", "Прочее");
	//Запрос.УстановитьПараметр("НеКредит", НеКредит);
	//Запрос.УстановитьПараметр("ТЗСкидок", СписокСкидок.Выгрузить());
	//Запрос.УстановитьПараметр("ГодВыпуска", Renault_ОбщегоНазначения.ПолучитьГодВыпуска(Автомобиль));

	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ТЗСкидок.КлючСтроки КАК КлючСтроки,
	//|	ТЗСкидок.КоммерческаяАкцияGUID КАК КоммерческаяАкцияGUID,
	//|	ТЗСкидок.Флажок КАК Флажок
	//|ПОМЕСТИТЬ ВТ_СкидкиДокумента
	//|ИЗ
	//|	&ТЗСкидок КАК ТЗСкидок
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	Renault_КоммерческиеАкции.КлючСтроки КАК КлючСтроки,
	//|	МАКСИМУМ(ВЫБОР
	//|			КОГДА Renault_КоммерческиеАкции.ВариантСкидки <> ""Процент""
	//|				ТОГДА Renault_КоммерческиеАкции.ЗначениеСкидки
	//|			ИНАЧЕ 0
	//|		КОНЕЦ) КАК ЗначениеСкидки,
	//|	МАКСИМУМ(Renault_КоммерческиеАкции.ЗначениеСкидкиУчастиеДилера) КАК ЗначениеСкидкиУчастиеДилера,
	//|	Renault_КоммерческиеАкции.КоммерческаяАкцияGUID КАК КоммерческаяАкцияGUID,
	//|	Renault_КоммерческиеАкции.ВариантСкидки КАК ВариантСкидки,
	//|	Renault_КоммерческиеАкции.Вид КАК Вид,
	//|	МАКСИМУМ(ВЫБОР
	//|			КОГДА Renault_КоммерческиеАкции.ВариантСкидки = ""Процент""
	//|				ТОГДА Renault_КоммерческиеАкции.ЗначениеСкидки
	//|			ИНАЧЕ 0
	//|		КОНЕЦ) КАК ПроцентСкидки
	//|ПОМЕСТИТЬ ВТ_Подготовка
	//|ИЗ
	//|	РегистрСведений.Renault_КоммерческиеАкции КАК Renault_КоммерческиеАкции
	//|ГДЕ
	//|	Renault_КоммерческиеАкции.ДатаНачалаДействия <= &Дата
	//|	И (Renault_КоммерческиеАкции.ДатаОкончанияДействия >= &Дата
	//|			ИЛИ Renault_КоммерческиеАкции.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1))
	//|	И Renault_КоммерческиеАкции.Модель = &Модель
	//|	И Renault_КоммерческиеАкции.Версия = &Версия
	//|	И Renault_КоммерческиеАкции.Вид = &Вид
	//|	И ВЫБОР
	//|			КОГДА &НеКредит
	//|				ТОГДА Renault_КоммерческиеАкции.ВидАкции <> ЗНАЧЕНИЕ(Перечисление.Renault_ВидыАкцийПроизводителя.Кредит)
	//|			ИНАЧЕ ИСТИНА
	//|		КОНЕЦ
	//|	И (Renault_КоммерческиеАкции.ВариантСкидки = ""Сумма""
	//|			ИЛИ Renault_КоммерческиеАкции.ВариантСкидки = ""Процент""
	//|			ИЛИ Renault_КоммерческиеАкции.ВариантСкидки = """")
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Renault_КоммерческиеАкции.КлючСтроки,
	//|	Renault_КоммерческиеАкции.КоммерческаяАкцияGUID,
	//|	Renault_КоммерческиеАкции.ВариантСкидки,
	//|	Renault_КоммерческиеАкции.Вид
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	Renault_КоммерческиеАкции.КлючСтроки,
	//|	МАКСИМУМ(ВЫБОР
	//|			КОГДА Renault_КоммерческиеАкции.ВариантСкидки <> ""Процент""
	//|				ТОГДА Renault_КоммерческиеАкции.ЗначениеСкидки
	//|			ИНАЧЕ 0
	//|		КОНЕЦ),
	//|	МАКСИМУМ(Renault_КоммерческиеАкции.ЗначениеСкидкиУчастиеДилера),
	//|	Renault_КоммерческиеАкции.КоммерческаяАкцияGUID,
	//|	Renault_КоммерческиеАкции.ВариантСкидки,
	//|	Renault_КоммерческиеАкции.Вид,
	//|	МАКСИМУМ(ВЫБОР
	//|			КОГДА Renault_КоммерческиеАкции.ВариантСкидки = ""Процент""
	//|				ТОГДА Renault_КоммерческиеАкции.ЗначениеСкидки
	//|			ИНАЧЕ 0
	//|		КОНЕЦ)
	//|ИЗ
	//|	РегистрСведений.Renault_КоммерческиеАкции КАК Renault_КоммерческиеАкции
	//|ГДЕ
	//|	Renault_КоммерческиеАкции.ДатаНачалаДействия <= &Дата
	//|	И (Renault_КоммерческиеАкции.ДатаОкончанияДействия >= &Дата
	//|			ИЛИ Renault_КоммерческиеАкции.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1))
	//|	И Renault_КоммерческиеАкции.Модель = &Модель
	//|	И Renault_КоммерческиеАкции.Версия = ЗНАЧЕНИЕ(Справочник.ВариантыКомплектации.ПустаяСсылка)
	//|	И Renault_КоммерческиеАкции.Вид = &Вид
	//|	И ВЫБОР
	//|			КОГДА &НеКредит
	//|				ТОГДА Renault_КоммерческиеАкции.ВидАкции <> ЗНАЧЕНИЕ(Перечисление.Renault_ВидыАкцийПроизводителя.Кредит)
	//|			ИНАЧЕ ИСТИНА
	//|		КОНЕЦ
	//|	И (Renault_КоммерческиеАкции.ВариантСкидки = ""Сумма""
	//|			ИЛИ Renault_КоммерческиеАкции.ВариантСкидки = ""Процент""
	//|			ИЛИ Renault_КоммерческиеАкции.ВариантСкидки = """")
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Renault_КоммерческиеАкции.КлючСтроки,
	//|	Renault_КоммерческиеАкции.КоммерческаяАкцияGUID,
	//|	Renault_КоммерческиеАкции.ВариантСкидки,
	//|	Renault_КоммерческиеАкции.Вид
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	Renault_КоммерческиеАкции.КлючСтроки,
	//|	МАКСИМУМ(ВЫБОР
	//|			КОГДА Renault_КоммерческиеАкции.ВариантСкидки <> ""Процент""
	//|				ТОГДА Renault_КоммерческиеАкции.ЗначениеСкидки
	//|			ИНАЧЕ 0
	//|		КОНЕЦ),
	//|	МАКСИМУМ(Renault_КоммерческиеАкции.ЗначениеСкидкиУчастиеДилера),
	//|	Renault_КоммерческиеАкции.КоммерческаяАкцияGUID,
	//|	Renault_КоммерческиеАкции.ВариантСкидки,
	//|	Renault_КоммерческиеАкции.Вид,
	//|	МАКСИМУМ(ВЫБОР
	//|			КОГДА Renault_КоммерческиеАкции.ВариантСкидки = ""Процент""
	//|				ТОГДА Renault_КоммерческиеАкции.ЗначениеСкидки
	//|			ИНАЧЕ 0
	//|		КОНЕЦ)
	//|ИЗ
	//|	РегистрСведений.Renault_КоммерческиеАкции КАК Renault_КоммерческиеАкции
	//|ГДЕ
	//|	Renault_КоммерческиеАкции.ДатаНачалаДействия <= &Дата
	//|	И (Renault_КоммерческиеАкции.ДатаОкончанияДействия >= &Дата
	//|			ИЛИ Renault_КоммерческиеАкции.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1))
	//|	И Renault_КоммерческиеАкции.Модель = ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)
	//|	И Renault_КоммерческиеАкции.Версия = ЗНАЧЕНИЕ(Справочник.ВариантыКомплектации.ПустаяСсылка)
	//|	И Renault_КоммерческиеАкции.Вид = &Вид
	//|	И ВЫБОР
	//|			КОГДА &НеКредит
	//|				ТОГДА Renault_КоммерческиеАкции.ВидАкции <> ЗНАЧЕНИЕ(Перечисление.Renault_ВидыАкцийПроизводителя.Кредит)
	//|			ИНАЧЕ ИСТИНА
	//|		КОНЕЦ
	//|	И (Renault_КоммерческиеАкции.ВариантСкидки = ""Сумма""
	//|			ИЛИ Renault_КоммерческиеАкции.ВариантСкидки = ""Процент""
	//|			ИЛИ Renault_КоммерческиеАкции.ВариантСкидки = """")
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Renault_КоммерческиеАкции.КлючСтроки,
	//|	Renault_КоммерческиеАкции.КоммерческаяАкцияGUID,
	//|	Renault_КоммерческиеАкции.ВариантСкидки,
	//|	Renault_КоммерческиеАкции.Вид
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_Подготовка.КлючСтроки КАК КлючСтроки,
	//|	МАКСИМУМ(ВТ_Подготовка.ЗначениеСкидки) КАК ЗначениеСкидки,
	//|	ВТ_Подготовка.КоммерческаяАкцияGUID КАК КоммерческаяАкцияGUID,
	//|	Renault_КоммерческиеАкции.ДатаНачалаДействия КАК ДатаНачалаДействия,
	//|	Renault_КоммерческиеАкции.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	//|	Renault_КоммерческиеАкции.КоммерческаяАкция КАК КоммерческаяАкция,
	//|	МАКСИМУМ(ВТ_Подготовка.ПроцентСкидки) КАК ПроцентСкидки,
	//|	ВТ_СкидкиДокумента.Флажок КАК Флажок,
	//|	Renault_КоммерческиеАкции.УсловиеПредоставления КАК УсловиеПредоставления
	//|ПОМЕСТИТЬ ВТ_Акции
	//|ИЗ
	//|	ВТ_Подготовка КАК ВТ_Подготовка
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_КоммерческиеАкции КАК Renault_КоммерческиеАкции
	//|		ПО ВТ_Подготовка.КоммерческаяАкцияGUID = Renault_КоммерческиеАкции.КоммерческаяАкцияGUID
	//|			И ВТ_Подготовка.КлючСтроки = Renault_КоммерческиеАкции.КлючСтроки
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СкидкиДокумента КАК ВТ_СкидкиДокумента
	//|		ПО ВТ_Подготовка.КоммерческаяАкцияGUID = ВТ_СкидкиДокумента.КоммерческаяАкцияGUID
	//|			И ВТ_Подготовка.КлючСтроки = ВТ_СкидкиДокумента.КлючСтроки
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТ_Подготовка.КоммерческаяАкцияGUID,
	//|	ВТ_Подготовка.КлючСтроки,
	//|	Renault_КоммерческиеАкции.ДатаНачалаДействия,
	//|	Renault_КоммерческиеАкции.ДатаОкончанияДействия,
	//|	Renault_КоммерческиеАкции.КоммерческаяАкция,
	//|	ВТ_СкидкиДокумента.Флажок,
	//|	Renault_КоммерческиеАкции.УсловиеПредоставления
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_Акции.КоммерческаяАкцияGUID КАК КоммерческаяАкцияGUID,
	//|	ВТ_Акции.КлючСтроки КАК КлючСтроки,
	//|	СУММА(ВТ_Акции.ЗначениеСкидки) КАК ЗначениеСкидки,
	//|	ВТ_Акции.ДатаНачалаДействия КАК ДатаНачалаДействия,
	//|	ВТ_Акции.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	//|	ВТ_Акции.КоммерческаяАкция КАК КоммерческаяАкция,
	//|	СУММА(ВТ_Акции.ПроцентСкидки) КАК ПроцентСкидки,
	//|	ЕСТЬNULL(ВТ_Акции.Флажок, ЛОЖЬ) КАК Флажок
	//|ПОМЕСТИТЬ ВТАкцииДляИсключения
	//|ИЗ
	//|	ВТ_Акции КАК ВТ_Акции
	//|ГДЕ
	//|	ВТ_Акции.УсловиеПредоставления.Наименование = ""Автомобили 2015 года выпуска""
	//|			И &ГодВыпуска <> 2015
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТ_Акции.КоммерческаяАкцияGUID,
	//|	ВТ_Акции.ДатаНачалаДействия,
	//|	ВТ_Акции.ДатаОкончанияДействия,
	//|	ВТ_Акции.КоммерческаяАкция,
	//|	ВТ_Акции.КлючСтроки,
	//|	ВТ_Акции.Флажок
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ВТ_Акции.КоммерческаяАкцияGUID,
	//|	ВТ_Акции.КлючСтроки,
	//|	ВТ_Акции.ЗначениеСкидки,
	//|	ВТ_Акции.ДатаНачалаДействия,
	//|	ВТ_Акции.ДатаОкончанияДействия,
	//|	ВТ_Акции.КоммерческаяАкция,
	//|	ВТ_Акции.ПроцентСкидки,
	//|	ЕСТЬNULL(ВТ_Акции.Флажок, ЛОЖЬ)
	//|ИЗ
	//|	ВТ_Акции КАК ВТ_Акции
	//|ГДЕ
	//|	ВТ_Акции.УсловиеПредоставления.Наименование = ""Автомобили 2016 года выпуска""
	//|			И &ГодВыпуска <> 2016
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ВТ_Акции.КоммерческаяАкцияGUID,
	//|	ВТ_Акции.КлючСтроки,
	//|	ВТ_Акции.ЗначениеСкидки,
	//|	ВТ_Акции.ДатаНачалаДействия,
	//|	ВТ_Акции.ДатаОкончанияДействия,
	//|	ВТ_Акции.КоммерческаяАкция,
	//|	ВТ_Акции.ПроцентСкидки,
	//|	ЕСТЬNULL(ВТ_Акции.Флажок, ЛОЖЬ)
	//|ИЗ
	//|	ВТ_Акции КАК ВТ_Акции
	//|ГДЕ
	//|	ВТ_Акции.УсловиеПредоставления.Наименование = ""Автомобили 2017 года выпуска""
	//|			И &ГодВыпуска <> 2017
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_Акции.КлючСтроки КАК КлючСтроки,
	//|	ВТ_Акции.ЗначениеСкидки КАК ЗначениеСкидки,
	//|	ВТ_Акции.КоммерческаяАкцияGUID КАК КоммерческаяАкцияGUID,
	//|	ВТ_Акции.ДатаНачалаДействия КАК ДатаНачалаДействия,
	//|	ВТ_Акции.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	//|	ВТ_Акции.КоммерческаяАкция КАК КоммерческаяАкция,
	//|	ВТ_Акции.ПроцентСкидки КАК ПроцентСкидки,
	//|	ВТ_Акции.Флажок КАК Флажок
	//|ИЗ
	//|	ВТ_Акции КАК ВТ_Акции
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТАкцииДляИсключения КАК ВТАкцииДляИсключения
	//|		ПО ВТ_Акции.КоммерческаяАкцияGUID = ВТАкцииДляИсключения.КоммерческаяАкцияGUID
	//|			И ВТ_Акции.КлючСтроки = ВТАкцииДляИсключения.ЗначениеСкидки
	//|ГДЕ
	//|	ВТАкцииДляИсключения.КоммерческаяАкцияGUID ЕСТЬ NULL";
	//
	//Скидки = Запрос.Выполнить().Выгрузить();
	//
	//Если Скидки.Количество() > 0 Тогда
	//	Скидки = Renault_ОбщегоНазначения.УдалитьНесовместимыеСкидкиRenault(Скидки);
	//КонецЕсли;
	//
	//мСписок = Новый Соответствие;
	//
	//Для каждого Выборка Из Скидки Цикл
	//	
	//	СтрокаСписка = Новый Структура("КоммерческаяАкцияGUID,
	//									|КоммерческаяАкция,
	//									|ДатаНачалаДействия,
	//									|ДатаОкончанияДействия,
	//									|ЗначениеСкидки,
	//									|ПроцентСкидки,
	//									|КлючСтроки,
	//									|Флажок");
	//	
	//	ГУИД = Новый УникальныйИдентификатор;
	//	
	//	ЗаполнитьЗначенияСвойств(СтрокаСписка, Выборка);
	//	
	//	мСписок.Вставить(ГУИД, СтрокаСписка);
	//	
	//КонецЦикла;
	//
	//Возврат мСписок;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СкидкаRenault = Справочники.ТипыСкидок.НайтиПоКоду("RenltCA");
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	МассивСтрок =  ВыбранноеЗначение;
	Если (ТипЗНЧ(ИсточникВыбора)  = Тип("УправляемаяФорма") и ИсточникВыбора.ИмяФормы = "Документ.Renault_Договор.Форма.ИзменениеСкидок") тогда
		НоваяСуммаСкидки = 0;
		Если МассивСтрок<>Неопределено Тогда
			Если МассивСтрок <> КодВозвратаДиалога.Отмена Тогда
				//СкидкиКоммерческие = СписокСкидок.НайтиСтроки(Новый Структура("ТипСкидки", СкидкаRenault));
				//СписокСкидок.Очистить();
				мСкидки = СписокСкидок.НайтиСтроки(Новый Структура("Акция", Справочники.DMS_КоммерческиеАкции.ПустаяСсылка()));
				Для Каждого СтрУдаления из мСкидки Цикл
					СписокСкидок.Удалить(СтрУдаления);
				КонецЦикла;
				//Для Каждого Стр Из СкидкиКоммерческие Цикл
				//	НовСкидка = СписокСкидок.Добавить();
				//	ЗаполнитьЗначенияСвойств(НовСкидка, Стр);
				//КонецЦикла;
				
				Для Каждого Стр Из МассивСтрок Цикл
					Если Стр.ТипСкидки.Пустая() Или Стр.СуммаСкидки=0 Тогда Продолжить КонецЕсли;
					НовСкидка = СписокСкидок.Добавить();
					ЗаполнитьЗначенияСвойств(НовСкидка,Стр);
					НоваяСуммаСкидки = НоваяСуммаСкидки + Стр.СуммаСкидки;
				КонецЦикла;	
			КонецЕсли;
		КонецЕсли;
		СуммаСкидки = НоваяСуммаСкидки;	
		//Козлов Е.А. Начало 24.01.2017
		СкидкаОбщаяПроцент = ?(ЗначениеЗаполнено(СуммаКонфигурации), 100 * (СуммаСкидки+СуммаАкций) / СуммаКонфигурации, 0);
		//СкидкаОбщаяПроцент = СуммаСкидки / СуммаКонфигурации * 100;
		//Козлов Е.А. Конец 
		СуммаКонечная = ПолучитьОбщуюСумму();
		ПоместитьСписокСкидокВоВременноеХранилище(КлючТаблицыСпискаСкидок);
		ОбновитьСуммы();
		УстановитьТекстСкидки();
	КонецЕсли;
КонецПроцедуры
//@++
